<template>
    <div id="comment">
        <div class="title">
            {{ title }}
        </div>
        <div class="author">
            <img :src='avatar' />
            {{ author }}评论
            <a @click="findBook()"> {{ book }}</a>
            于{{ time }}
        </div>
        <p id="content">
            {{ content }}
        </p>

        <div class="likes">
            <Button icon='android-favorite-outline'>{{ like }}</Button>
        </div>

        <div id="replys">
            <Card v-for="i in replys" :key='i.usr'>
                <div class="usrs">
                    {{ i.usr }} {{ i.date }}
                </div>
                <div class="reps">
                    {{ i.say }}
                    <span class="repLike">
                        <Button icon='android-favorite-outline'>{{ i.like }}</Button>
                    </span>
                </div>
            </Card>
        </div>
    </div>
</template>

<style scoped>
#comment {
    width: 42%;
    margin: auto;
}
</style>

<script>
/* eslint-disable */
export default {
    data: function() {
        return {
            id: 1,
            title: '流浪到天明',
            author: '清隐',
            avatar: 'https://img3.doubanio.com/icon/u1282831-50.jpg',
            like: 102,
            reply: 48,
            book: '撒哈拉的故事',
            time: '2008-06-13 18:27:59',
            content: `前段时间看齐豫的专访，不例外地提到三毛。
她说初见三毛很有些吃惊，极瘦小一个女子，觉察不出经历过那么多故事。

三毛的确貌不惊人，连“三毛”这名字也嫌潦草——也不知是她明了自身天性取了这名字，还是这个流浪的名字注定了她一生颠沛。

第一次读她是《稻草人手记》，从打开书那一刻笑容便没消去过。其后又读了《梦里花落知多少》《我的宝贝》《滚滚红尘》……许多许多。最最钟意还是这一本《撒哈拉》。每每想起《白手成家》里为了看牢向人索来的几块棺材木而不时上屋顶查看的三毛，心中都会生出许多心疼与怜爱来。
我向来是偏爱女孩子写的文章的，以为其中自有一份女性独有的缜密、矜持和俏皮，还有些对生活的苛求。但三毛与张爱玲、林徽因、倪亦舒们又是如此不同。在饱暖安平的世界里写就的好文章自然是值得欣赏的，但若是在连洗澡都奢侈的沙漠、在无端逼仄起来的生活空间，还要过一段有声有色的日子，甚至将这份珍贵经历传递到故乡的土地去，这个女子要有怎样的热情，让严厉的沙漠也给她笑容。


三毛说她第一次见着撒哈拉，像见到久违的故乡。那时她已在异国多年，也心存了各种风情。但还有比沙漠更适合安顿下三毛的云游四方的心的居所吗？沙本是世间最无依无着之物，安定流浪听凭风停风起。而沙漠收容他们——还有三毛，一并揽入它的怀抱。
它是诚实的，它不虚荣。它不用你精致，不用你化妆，不用你给予，只要你心安。
这便是故乡了。


三毛实在幸运，苦恋她六年的男人也是懂得她的。爱着三毛的荷西也是幸运，三毛虽然疯狂又爱流浪，但却专一与自爱。
我向来以为，对待一个好姑娘无非两种方式：捧起来读，或者拥起来爱。荷西对三毛真是范本。他仰慕尊重她，又不似沈从文对张兆和那般恋慕得仿佛信徒对待女神；他们亦有小儿女情怀，但也没有彼此耽溺。

世间无数怨偶佳偶，无非是两人间爱之存亡。但相爱是一回事，相知又是一回事，找到知己总比找到爱情更难。
荷西三毛决计是不需什么红颜蓝颜，因为自己的爱人便是知己。结婚礼物是骆驼头骨，大概只有荷西做得出来，也大概只有三毛会欢喜接受。看两人之间的小打小闹更是可爱。三毛让荷西拿邻家的漂亮女孩当海市蜃楼，三毛丢下丈夫回到台湾时荷西又在信件捏造出一个卡洛叫三毛吃醋赶回。一些小聪明，也曾共患难——还有比这更完整的爱吗。


又因为知道他们之间这样亲密，所以看荷西去世后三毛的作品，总有些黯然。
“我只有一杯浓烈的爱酒，就这样被你泼掉了。”
故乡还是故乡，沙漠还是沙漠。只是那个人缺席。


我们的心也一并缺席了。`,
            replys: [
                {
                    usr: '罐头里的鱼',
                    date: '2008-06-14 07:13:17',
                    say: `每个人都会有自己所思所想. 
                        每每感动我们的只是那一点点小小的细节. 
                        喜欢她的一切,喜欢她的生活方式. 
                        喜欢... `,
                    like: 11
                },
                {
                    usr: 'cc',
                    date: '2008-06-14 10:37:14',
                    say: `我喜欢看白手起家，也喜欢把白手起家推荐给我看的那个女子 `,
                    like: 8
                }
            ]
        }
    }
}
</script>

